KaelanFouwels/Rover32/PIC32/WIFIROVER2016Gx/TCPIP/demo/rovercode.c
#include "p32mx340f256h.h"

// Include all headers for any enabled TCPIP-Stack functions
#include "TCPIP-Stack/TCPIP.h"

#if defined(STACK_USE_ZEROCONF_LINK_LOCAL)
#include "TCPIP-Stack/ZeroconfLinkLocal.h"
#endif
#if defined(STACK_USE_ZEROCONF_MDNS_SD)
#include "TCPIP-Stack/ZeroconfMulticastDNS.h"
#endif

// Include functions specific to this stack application
#include "MainDemo.h"
#include "i2c.h"
#include <math.h>

#define versionhigh 2
#define versionlow 1

#define CMDNULL 0
#define CMDGETSW 1
#define CMDSETLED 2
#define CMDGETCOUNT 3
#define CMDMOTORSTATUS 4
#define CMDSETMOTOR1 5
#define CMDSETMOTOR2 6
#define CMDSETBOTHMOTORS 7
#define CMDGETLINEFOLLOW 8
#define CMDSETLINEFOLLOW 9
#define CMDGETLIGHTTEMP 17
#define CMDPOWERSWITCH 21
#define CMDPOWERSERV01 22
#define CMDPOWERSERV02 23
#define CMDPOWERREADAD0 24
#define CMDPOWERREADAD1 25
#define CMDPOWERREADphotodiode 26
#define CMDPOWERREADthermistor 27
#define CMDREADemfs 30
#define CMDRDlightsensors 31
#define CMDMyMAC 32
#define CMDRDMMA8452 40
#define CMDRDgyroSTATUS 46
#define CMDRDgyro 43
#define CMDMagSTATUS 44
#define CMDMag 45
#define CMDdoSTEP 50
#define CMDStepStatus 51
#define CMDStepRead 52
#define CMDstepInstRead 53
#define CMDreadSounds 54
#define CMDGetMotorSpeedWord 55
#define CMDMotorSpeedClosed 56
//#define CMDGETstarpos 57
#define CMDGETusgps 58

#define CMDGETversion 63

#define speedhyst 100

#define CMDGyroPosition 201
#define CMDRotateRadians 202

#define CMDGetIsMovingForward 203
#define CMDMoveForward 204
#define CMDMagAngle 205

#define CMDMoveBearing 206

#define CMDGetAcceleromterCache 207



void initi2Cs(void);

// Private helper functions.
// These may or may not be present in all applications.
void InitAppConfig(void);
void InitializeBoard(void);
void ProcessIO(void);
void POSTTCPchar(char b);
void POSTTCPhead(int len, int id);


//extern volatile BYTE GPSRX[8];
//extern volatile int GPSRXcount;
//extern volatile int GPSRXcount;
volatile int LINEA, LINEB;
volatile int LINEAa, LINEBa;
volatile int emf1v, emf2v;
;
volatile int photov, thermv;
volatile int lightav, lightbv;
volatile char ToggleLine = 1;

int emfoffset1 = 16380;
int emfoffset2 = 16380;
int setemfoff = 8000;

int LINETa = 512; // if below this value then black line
int LINETb = 512;

char sounds[2048];
volatile int soundhead = 0;
int soundtail = 0;

//volatile int pwmgate;

char countup1 = 1; // new - better distance
char countup2 = 1; // new - better distance
int speed1 = 0;
int pos1 = 0;
int speed2 = 0;
int pos2 = 0;
volatile DWORD lasticA = 0;
volatile DWORD lasticB = 0;
volatile DWORD HlasticA0, HlasticA1;
volatile DWORD HlasticB0, HlasticB1;
volatile UINT16 CspeedA, CspeedB;
volatile unsigned char IC1F, IC3F;
volatile UINT16 /*dificA0,dificA1,*/lasticAS0, lasticAS1;
volatile UINT16 /*dificB0,dificB1,*/lasticBS0, lasticBS1;
volatile UINT32 dificA1t, dificA0t, dificB0t, dificB1t;
volatile UINT32 PeriodA, PeriodB;
volatile int timeoutA, timeoutB;

char closedloop = 0;
volatile char CLflag = 0;
INT16 DesiredL = 0;
INT16 DesiredR = 0;
INT16 erroriL, erroriR;
INT16 errorL, errorR;
INT16 LasterrorL, LasterrorR;
INT16 McmdL = 0;
INT16 McmdR = 0;
volatile int MotorPWMcount = 0;
volatile int MotorleftV = 0;
volatile int MotorrightV = 0;
volatile int ForwardDistanceRemaining = 0;
volatile char isFowardDistanceBackwards = 0;

//magnetometer

volatile float MagXMin = 999999;
volatile float MagXMax = -999999;
volatile float MagYMin = 999999;
volatile float MagYMax = -999999;
volatile float MagX = 0;
volatile float MagY = 0;
volatile float MagZ = 0;
volatile int MagHasValue = 0;
volatile float MagAngle = 0;
volatile int MagHasAngle = 0;

volatile int MagRotationTicksRemaining = 0;
volatile int MagHasFlipped = 0;
volatile int MagLastDirection = 0;
volatile float MagCurrentBearingTarget = 0.0;

volatile float sx = 0;
volatile float sy = 0;

#define RXBUFFERsize 256
volatile unsigned char RX1[RXBUFFERsize];
volatile int RxHead1, RxTail1;
volatile unsigned char RX2[RXBUFFERsize];
volatile int RxHead2, RxTail2;

volatile int pos1Zero = 0;
volatile int pos2Zero = 0;

volatile int magnetometerFlag = 0;
volatile int magnetometerCounter = 0;

volatile float rotationTarget = 0;
volatile int areRotating = 0;
volatile int rotationFlag = 0;
volatile int rotationCounter = 0;

volatile int movementFlag = 0;
volatile int movementCounter = 0;

volatile int magnetometerAngleFlag = 0;
volatile int magnetometerAngleCounter = 0;

volatile int ledCounter = 0;
volatile int ledFlag = 0;

volatile int isMoving = 0;

#define accelerometerCacheSize 100
volatile int accelerometerCache[accelerometerCacheSize];
volatile int accelerometerCachePointer = 0;
volatile int accelerometerFlag = 0;
volatile int accelerometerCounter = 0;
volatile int accelerometerX = 0;
volatile int accelerometerY = 0;
volatile int accelerometerZ = 0;

INT16 gyroRotationRadians = 0;

typedef union _data {
    float f;
    char s[4];
} floatUnion;

void startmyINTs(void) {
    IEC0bits.IC1IE = 1;
    IEC0bits.IC3IE = 1;
    IEC1bits.AD1IE = 1;
    IEC0bits.U1EIE = 1;
    IEC0bits.U1RXIE = 1;
    IEC0bits.U1TXIE = 1;
    IEC1bits.U2EIE = 1;
    IEC1bits.U2RXIE = 1;
    IEC1bits.U2TXIE = 1;
}

int testU1(void) {
    int nchars;
    nchars = RxHead1 - RxTail1;
    if (nchars < 0) nchars += RXBUFFERsize;
    return (nchars);
}

unsigned char readU1() {
    unsigned char res;
    res = 0;
    if (testU1()) {
        res = RX1[RxTail1++];
        RxTail1 &= (RXBUFFERsize - 1);
    }
    return (res);
}

unsigned char peakU1() {
    unsigned char res;
    res = 0;
    if (testU1()) {
        res = RX1[RxTail1];
    }
    return (res);
}

void flushU1(int n) {
    int i;
    for (i = 0; i < n; i++) readU1();
}

int testU2(void) {
    int nchars;
    nchars = RxHead2 = RxTail2;
    if (nchars < 0) nchars += RXBUFFERsize;
    return (nchars);
}

void getMagnetometer(void) {

