KaelanFouwels/Rover32/PIC32/WIFIROVER2016Gx/TCPIP/demo/rovercode.c
    float A = 0.9;

    int i;

    unsigned short values[6];

    int success = 1;

    I2S();
    I2send(0x1c);
    I2send(0);
    I2SR();
    I2send(0x1d);
    if ((I2GET(0) & 0x8) == 0) {
        success = 0;
        I2P();
    } else {
        I2P();
        I2S();
        I2send(0x1c);
        I2send(1);
        I2SR();
        I2send(0x1d);
        for (i = 1; i <= 6; i++) {
            values[i - 1] = I2GET(i != 6);
        }
        I2P();
    }

    if (success) {

        float MagXn = (short) (values[1] | values[0] << 8);
        float MagYn = (short) (values[3] | values[2] << 8);
        float MagZn = (short) (values[5] | values[4] << 8);

        MagX = A * MagXn + (1 - A) * MagX;
        MagY = A * MagYn + (1 - A) * MagY;

        MagXMin = MagX < MagXMin ? MagX : MagXMin;
        MagYMin = MagY < MagYMin ? MagY : MagYMin;

        MagXMax = MagX > MagXMax ? MagX : MagXMax;
        MagYMax = MagY > MagYMax ? MagY : MagYMax;

        MagHasValue = 1;
    }


}

void getMagnetometerAngle(void) {

    if (MagXMax == MagXMin) {
        return;
    }
    if (MagYMax == MagYMin) {
        return;
    }

    sx = ((MagX - MagXMin) / (MagXMax - MagXMin)) - 0.5;
    sy = ((MagY - MagYMin) / (MagYMax - MagYMin)) - 0.5;

    float newMagAngle = atan2f(sy, sx);

    if (!(newMagAngle * MagAngle >= 0.0f)) {
        MagHasFlipped = 1;
        //Account for overflow from -180 + 1 to 180
    }
    MagAngle = newMagAngle;
    MagHasAngle = 1;
}

unsigned char readU2() {
    unsigned char res;
    res = 0;
    if (testU2()) {
        res = RX2[RxTail2++];
        RxTail2 &= (RXBUFFERsize - 1);
    }
    return (res);
}

unsigned char peakU2() {
    unsigned char res;
    res = 0;
    if (testU2()) {
        res = RX2[RxTail2];
    }
    return (res);
}

void doclosedloop(void) {
    INT16 I16;
    INT16 derrorL, derrorR;
    if (DesiredL == 0) {
        speed2 = 0;
        erroriL = 0;
    } else {

        if (countup2) I16 = -CspeedB;
        else I16 = CspeedB;

        //	  I16=(emf2v-emfoffset2);
        if (I16 > 8191) I16 = 8191;
        if (I16<-8191) I16 = -8191;
        errorL = (DesiredL + I16);
        if (errorL > 1000) errorL = 1000;
        else if (errorL<-1000) errorL = -1000;
        derrorL = LasterrorL - errorL;
        LasterrorL = errorL;
        erroriL += errorL / 50;
        if (erroriL > 1000) erroriL = 1000;
        else if (erroriL<-1000) erroriL = -1000;
        McmdL = (errorL / 4) + erroriL - derrorL;
        if (McmdL > 2047) speed2 = 2047;
        else {
            if (McmdL<-2047) speed2 = -2047;
            else {
                speed2 = McmdL;
            }
        }

    }
    if (DesiredR == 0) {
        speed1 = 0;
        erroriR = 0;
    } else {
        if (countup1) I16 = -CspeedA;
        else I16 = CspeedA;
        //      I16=(emf1v-emfoffset1);
        if (I16 > 8191) I16 = 8191;
        if (I16<-8191) I16 = -8191;
        errorR = (DesiredR + I16);
        if (errorR > 1000) errorR = 1000;
        else if (errorR<-1000) errorR = -1000;
        derrorR = LasterrorR - errorR;
        LasterrorR = errorR;
        erroriR += errorR / 50;
        if (erroriR > 1000) erroriR = 1000;
        else if (erroriR<-1000) erroriR = -1000;
        McmdR = (errorR / 4) + erroriR - derrorR;
        if (McmdR > 2047) speed1 = 2047;
        else {
            if (McmdR<-2047) speed1 = -2047;
            else {
                speed1 = McmdR;
            }
        }
    }
    CLflag = 0;
}

void getAccelerometerUp(void) {
    // if cache full, return;
    if (accelerometerCachePointer >= accelerometerCacheSize - 1) {
        return;
    }

    int i;
    char a;
    char b;

    I2S();
    I2send(0x38);
    I2send(0x00);
    I2SR();
    I2send(0x39);
    i = I2GET(0);
    I2P();
    if (i & 8) {
        I2S();
        I2send(0x38);
        I2send(0x01);
        I2SR();
        I2send(0x39);

        a = I2GET(1);
        b = I2GET(1);
        accelerometerX = (a << 8) | b;

        a = I2GET(1);
        b = I2GET(1);
        accelerometerY = (a << 8) | b;

        a = I2GET(1);
        b = I2GET(0);
        accelerometerZ = (a << 8) | b;

        accelerometerCache[accelerometerCachePointer] = accelerometerZ;
        accelerometerCachePointer++;

        I2P();
    }


}



volatile unsigned char setLineLed = 0;

void __attribute((interrupt(ipl3), vector(_ADC_VECTOR), nomips16)) _ADCInterrupt(void) {

    //4Hz
    ledCounter++;
    if (ledCounter == 10000) {
        ledCounter = 0;
        ledFlag = 1;
    }

    //40Hz
    magnetometerCounter++;
    if (magnetometerCounter == 1000) {
        magnetometerCounter = 0;
        magnetometerFlag = 1;
    }

    //10Hz
    magnetometerAngleCounter++;
    if (magnetometerAngleCounter == 1000) {
        magnetometerAngleCounter = 0;
        magnetometerAngleFlag = 1;
    }

    //40Hz
    rotationCounter++;
    if (rotationCounter == 1000) {
        rotationCounter = 0;
        rotationFlag = 1;
    }

    //100Hz
    movementCounter++;
    if (movementCounter == 400) {
        movementCounter = 0;
        movementFlag = 1;
    }

    //100Hz
    accelerometerCounter++;
    if (accelerometerCounter == 400) {
        accelerometerCounter = 0;
        accelerometerFlag = 1;
    }

    int v;
    MotorPWMcount++;
    if (MotorPWMcount > (511 + (8 * 16))) {
        if (speed1) {
            if (speed1 < 0) {
                _LATD3 = 1;
                MotorleftV = (-speed1) >> 2;
            } else {
                _LATD4 = 1;
                MotorleftV = (speed1) >> 2;
            }
        }
        if (speed2) {
            if (speed2 < 0) {
                _LATD1 = 1;
                MotorrightV = (-speed2) >> 2;
            } else {
                _LATD2 = 1;
                MotorrightV = (speed2) >> 2;
            }
        }
        MotorPWMcount = 0;
        if (closedloop) CLflag = 1;
    } else {
        if (MotorleftV <= MotorPWMcount) {
            LATD &= ~0x0018;
        }
        if (MotorrightV <= MotorPWMcount) {
            LATD &= ~0x0006;
        }
    }

    if (ToggleLine) {
        if (MotorPWMcount > 256) {
            if (setLineLed == 1) setLineLed = 2;
        } else {
            if (setLineLed == 0) setLineLed = 3;
        }
    }
    if (AD1CON2bits.BUFS) {
        if (ToggleLine) {
            if (setLineLed & 2) {
                setLineLed &= 1;
                if (setLineLed) {
                    LINEA = LINEAa - ADC1BUF0;
                    LINEB = LINEBa - ADC1BUF1;
                    LED2_IO = 1;
                    LED3_IO = 1;
                } else {
                    LINEAa = ADC1BUF0;
                    LINEBa = ADC1BUF1;
                    LED2_IO = 0;
                    LED3_IO = 0;
                }
            }
        } else {
            LINEA = ADC1BUF0;
            LINEB = ADC1BUF1;
        }
        if (MotorPWMcount > (511 + 32)) {
            emf2v += (int) ADC1BUF2 - (emf2v / 16);
            emf1v += (int) ADC1BUF3 - (emf1v / 16);
            if (setemfoff) {
                setemfoff--;
                if (setemfoff == 0) {
                    emfoffset1 = emf1v;
                    emfoffset2 = emf2v;
                }
            }

            v = emf1v - emfoffset1;
            if (v > speedhyst) {//if (countup1) {lasticA0=lasticA1=0;dificA=0xffff;}
                countup1 = 0;
            } else if (v<-speedhyst) {//if (!countup1) {lasticA0=lasticA1=0;dificA=0xffff;}
                countup1 = 1;
            }
            if (timeoutA < 0xff) {
                timeoutA++;
            } else PeriodA = 0x400000;
            //     if ((TickGet()-HlasticA)>0x11000) PeriodA=0xfffff;
            v = emf2v - emfoffset2;
            if (v > speedhyst) {//if (countup2) {lasticB0=lasticB1=0;dificB=0xffff;}
                countup2 = 0;
            } else
                if (v<-speedhyst) {//if (!countup2) {lasticB0=lasticB1=0;dificB=0xffff;}
                countup2 = 1;
            }
            if (timeoutB < 0xff) {
                timeoutB++;
            } else PeriodB = 0x400000;
            //     if ((TickGet()-HlasticB)>0x11000) PeriodB=0xfffff;
        }
        photov = ADC1BUF4;
        sounds[soundhead++] = photov >> 2;
        soundhead &= 2047;
        thermv = ADC1BUF5;
        lightav = ADC1BUF6;
        lightbv = ADC1BUF7;
    } else {
        if (ToggleLine) {
            if (setLineLed & 2) {
                setLineLed &= 1;
                if (setLineLed) {
                    LINEA = LINEAa - ADC1BUF8;
                    LINEB = LINEBa - ADC1BUF9;
                    LED2_IO = 1;
                    LED3_IO = 1;
                } else {
                    LINEAa = ADC1BUF8;
                    LINEBa = ADC1BUF9;
                    LED2_IO = 0;
                    LED3_IO = 0;
                }
            }
        } else {
            LINEA = ADC1BUF8;
            LINEB = ADC1BUF9;
        }
        if (MotorPWMcount > (511 + 32)) {
            emf2v += (int) ADC1BUFA - (emf2v / 16);
            emf1v += (int) ADC1BUFB - (emf1v / 16);
            if (setemfoff) {
                setemfoff--;
                if (setemfoff == 0) {
                    emfoffset1 = emf1v;
                    emfoffset2 = emf2v;
                }
            }
            v = emf1v - emfoffset1;
            if (v > speedhyst) {//if (countup1) {lasticA0=lasticA1=0;dificA=0xffff;}
                countup1 = 0;
            }
            if (v<-speedhyst) {//if (!countup1) {lasticA0=lasticA1=0;dificA=0xffff;}
                countup1 = 1;
            }
            v = emf2v - emfoffset2;
            if (v > speedhyst) {//if (countup2) {lasticB0=lasticB1=0;dificB=0xffff;}
                countup2 = 0;
            }
            if (v<-speedhyst) {//if (!countup2) {lasticB0=lasticB1=0;dificB=0xffff;}
                countup2 = 1;
            }
        }
        photov = ADC1BUFC;
        sounds[soundhead++] = photov >> 2;
        soundhead &= 2047;
        thermv = ADC1BUFD;
        lightav = ADC1BUFE;
        lightbv = ADC1BUFF;
    }

    IFS1bits.AD1IF = 0;
}

int delta1 = 0;
int delta2 = 0;

