KaelanFouwels/Rover32/PIC32/WIFIROVER2016Gx/TCPIP/demo/rovercode.c
void __attribute((interrupt(ipl4), vector(_INPUT_CAPTURE_1_VECTOR), nomips16)) _IC1Interrupt(void) {
    UINT16 vv;
    UINT32 TD;
    //if (countup1) pos1++; else pos1--;  // new - better distance
    //if (speed1>=0) pos1++; else pos1--;
    if (speed1 > 0) delta1 = 1;
    if (speed1 < 0) delta1 = -1;
    pos1 += delta1;
    lasticA = TickGet();
    timeoutA = 0;
    vv = IC1BUF & 0xffff;
    if (IC1F) {
        dificA1t = (UINT16) (vv - lasticAS1);
        TD = lasticA - HlasticA1;
        if (TD > 0xf000) PeriodA += (TD - (PeriodA / 8));
        else
            PeriodA += (dificA1t - (PeriodA / 8));
        if (PeriodA > 0x100000) PeriodA = 0x100000;
        lasticAS1 = vv;
        HlasticA1 = lasticA;
        IC1F = 0;
    } else {
        dificA0t = (UINT16) (vv - lasticAS0);
        TD = lasticA - HlasticA0;
        if (TD > 0xf000) PeriodA += (TD - (PeriodA / 8));
        else
            PeriodA += (dificA0t - (PeriodA / 8));
        if (PeriodA > 0x100000) PeriodA = 0x100000;
        lasticAS0 = vv;
        HlasticA0 = lasticA;
        IC1F = 1;
    }



    if (!IC1CONbits.ICBNE) IFS0bits.IC1IF = 0;
}

void __attribute((interrupt(ipl4), vector(_INPUT_CAPTURE_2_VECTOR), nomips16)) _IC2Interrupt(void) {
    IFS0bits.IC2IF = 0;
}

void __attribute((interrupt(ipl4), vector(_INPUT_CAPTURE_3_VECTOR), nomips16)) _IC3Interrupt(void) {
    UINT16 vv;
    UINT32 TD;
    //if (countup2>0) pos2++; else pos2--;  // new - better distance
    lasticB = TickGet();
    //if (speed2>=0) pos2++; else pos2--;
    if (speed2 > 0) delta2 = 1;
    if (speed2 < 0) delta2 = -1;
    pos2 += delta2;
    timeoutB = 0;

    vv = IC3BUF & 0xffff;

    if (IC3F) {
        dificB1t = (UINT16) (vv - lasticBS1);
        TD = lasticB - HlasticB1;
        if (TD > 0xf000) PeriodB += (TD - (PeriodB / 8));
        else
            PeriodB += (dificB1t - (PeriodB / 8));
        if (PeriodB > 0x100000) PeriodB = 0x100000;
        lasticBS1 = vv;
        HlasticB1 = lasticB;
        IC3F = 0;
    } else {
        dificB0t = (UINT16) (vv - lasticBS0);
        TD = lasticB - HlasticB0;
        if (TD > 0xf000) PeriodB += (TD - (PeriodB / 8));
        else
            PeriodB += (dificB0t - (PeriodB / 8));
        if (PeriodB > 0x100000) PeriodB = 0x100000;
        lasticBS0 = vv;
        HlasticB0 = lasticB;
        IC3F = 1;
    }




    if (!(IC3CONbits.ICBNE)) IFS0bits.IC3IF = 0;
}

void __attribute((interrupt(ipl4), vector(_INPUT_CAPTURE_4_VECTOR), nomips16)) _IC4Interrupt(void) {
    IFS0bits.IC4IF = 0;
}

#define comsdatasize 1024
char comsdata[comsdatasize];
unsigned int comsdatahead = 0;
unsigned int comsdatatail = 0;

void putcomsdata(char v) {
    unsigned int nhead;
    nhead = comsdatahead + 1;
    if (nhead >= comsdatasize) nhead -= comsdatasize;
    if (nhead != comsdatatail) {
        comsdatahead = nhead;
        comsdata[comsdatahead] = v;
    }
}

char yescomsdata(void) {
    if (comsdatatail != comsdatahead) return (1);
    else return (0);
}

char getcomsdata(void) {
    if (comsdatatail == comsdatahead) return (0);
    comsdatatail++;
    if (comsdatatail >= comsdatasize) comsdatatail -= comsdatasize;
    return (comsdata[comsdatatail]);
}

char peekcomsdata(void) {
    int i;
    if (comsdatatail == comsdatahead) return (0);
    i = comsdatatail + 1;
    if (i >= comsdatasize) i -= comsdatasize;
    return (comsdata[i]);
}

UINT16 globalRSSI = 255;

void POSTTCPhead(int len, int id) {
    POSTTCPchar(0xff);
    POSTTCPchar(len + 2);
    POSTTCPchar(globalRSSI);
    POSTTCPchar(id);
}
int commandstate = -1;
int commandlen;
unsigned char nextcommand[256];
UINT16 REQCOUNT = 0;
int waveid = 0;
int res;

void initi2Cs(void) // called once when rover starts
{
    //setup accn MMA8452Q
    I2S();
    I2send(0x38);
    I2send(0x0d);
    I2SR();
    I2send(0x39);
    res = I2GET(0);
    I2P();
    I2S();
    I2send(0x38);
    I2send(0x2a);
    I2send(0x20);
    I2send(0x2);
    I2P(); //50Hz nonactive
    I2S();
    I2send(0x38);
    I2send(0x2a);
    I2send(0x21);
    I2P(); //50Hz active

    //setup gyro L3G4200D
    I2S();
    I2send(0xd2);
    I2send(0x0f);
    I2SR();
    I2send(0xd3);
    res = I2GET(0);
    I2P();
    I2S();
    I2send(0xd2);
    I2send(0x20 | 0x80);
    I2send(0x3f); // 100 sps 25hz cutoff
    I2send(0x06); //HP 0.1Hz
    I2send(0x00);
    I2send(0x11); // 500 degrees/S full scale
    I2send(0x10); // HP enable
    I2P();

    //setup mag MAG3110FCR1
    I2S();
    I2send(0x1c);
    I2send(0x7);
    I2SR();
    I2send(0x1d);
    res = I2GET(0);
    I2P();
    if (res == 0xc4) {
        I2S();
        I2send(0x1c);
        I2send(0x10);
        I2send(0x09);
        I2send(0x30);
        I2P(); //40Hz
        do {
            I2S();
            I2send(0x1c);
            I2send(0x11);
            I2SR();
            I2send(0x1d);
            res = I2GET(0);
            I2P();
        } while (res & 0x10);

    }
}

void setspeed(int newspeed1, int newspeed2) // routine sets speed of motors
// only alters motors if speed has changed
{
    if (newspeed1 != speed1) {
        speed1 = newspeed1;
        //	setpwmA();
    }
    if (newspeed2 != speed2) {
        speed2 = newspeed2;
        //	 setpwmB();
    }
    erroriL = 0;
    erroriR = 0;
}

int bptag = 0;

void checkRotation() {

    int newDirection = 0;

    if (!MagHasAngle) {
        return;
    }

    float offset = 0.05;

    if (rotationTarget >= 0 && MagAngle >= rotationTarget - offset && MagAngle <= rotationTarget) {
        areRotating = 0;
    } else if (rotationTarget < 0 && MagAngle <= rotationTarget + offset && MagAngle >= rotationTarget) {
        areRotating = 0;
    }

    if (rotationTarget < 0 && MagAngle > rotationTarget) {
        newDirection = 0;
    } else if (rotationTarget < 0 && MagAngle < rotationTarget) {
        newDirection = 1;
    } else if (rotationTarget >= 0 && MagAngle > rotationTarget) {
        newDirection = 0;
    } else if (rotationTarget >= 0 && MagAngle < rotationTarget) {
        newDirection = 1;
    }

    if (areRotating == 0) {
        setspeed(0, 0);
    } else if (newDirection == 1) {
        setspeed(800, -800);
    } else {
        setspeed(-800, 800);
    }
}

//union {
//    float fval;
//    char bval[4];
//} floatAsBytes;

void processcommand(void) // the main routine which processes commands
{
    int i, j;
    float f;
    unsigned char temparray[10];
    unsigned char Blow, Bhigh;

