KaelanFouwels/Rover32/PIC32/WIFIROVER2016Gx/TCPIP/demo/rovercode.c
    int temphead;

    floatUnion myfloatUnion;

    switch (nextcommand[0]) // sort on command id (each case is for a different command)
    {
        case CMDNULL:POSTTCPhead(0, CMDNULL);
            break;
        case CMDGETSW:POSTTCPhead(1, CMDGETSW); //Ask for Led and Switch status Packet
            i = ((~PORTE << 2) & 0xc) | ((LATE << 2) & 0x30);
            if ((PORTD & 0x40) == 0) i |= 0x2;
            if ((PORTD & 0x80) == 0) i |= 0x1;
            POSTTCPchar(i);
            break;
        case CMDSETLED:if (commandlen == 1) //Set LEDs
            {
                if (nextcommand[1] & 2) LED1_IO = 0;
                else LED1_IO = 1;
                if (nextcommand[1] & 1) LED0_IO = 0;
                else LED0_IO = 1;
                POSTTCPhead(0, CMDSETLED);
                break;
            }
            break;
        case CMDGETCOUNT:POSTTCPhead(2, CMDGETCOUNT); // get internal counter
            POSTTCPchar((REQCOUNT >> 8) & 0xff);
            POSTTCPchar(REQCOUNT & 0xff);
            REQCOUNT++;
            break;

        case CMDGETversion:POSTTCPhead(2, CMDGETversion); // get version
            POSTTCPchar(versionhigh);
            POSTTCPchar(versionlow);
            break;
        case CMDMOTORSTATUS: // request motor status here
            POSTTCPhead(9, CMDMOTORSTATUS);
            POSTTCPchar(speed1 >> 4);
            POSTTCPchar(pos1 >> 8);
            POSTTCPchar(pos1);

            POSTTCPchar(speed2 >> 4);
            POSTTCPchar(pos2 >> 8);
            POSTTCPchar(pos2);
            POSTTCPchar(0);
            POSTTCPchar(0);
            POSTTCPchar(0);
            break;

        case CMDMoveBearing:

            myfloatUnion.s[0] = nextcommand[1];
            myfloatUnion.s[1] = nextcommand[2];
            myfloatUnion.s[2] = nextcommand[3];
            myfloatUnion.s[3] = nextcommand[4];
            rotationTarget = myfloatUnion.f;
            areRotating = 1;
            break;

        case CMDSETMOTOR1:if (commandlen == 1) // set motor1
            {
                i = (char) nextcommand[1];
                closedloop = 0;
                setspeed(i * 16, speed2);
                POSTTCPhead(0, CMDSETMOTOR1);
            }
            break;
        case CMDSETMOTOR2:if (commandlen == 1) // set motor2
            {
                i = (char) nextcommand[1];
                closedloop = 0;
                setspeed(speed1, i * 16);
                POSTTCPhead(0, CMDSETMOTOR2);
            }
            break;
        case CMDSETBOTHMOTORS:if (commandlen == 2) // set both motors
            {
                i = (char) nextcommand[1];
                j = (char) nextcommand[2];
                closedloop = 0;
                setspeed(i * 16, j * 16);
                POSTTCPhead(0, CMDSETBOTHMOTORS);
            }
            break;


        case CMDGETLINEFOLLOW: // report line following
            POSTTCPhead(5, CMDGETLINEFOLLOW);
            i = 0;
            if (LINEA < LINETa) i |= 1;
            if (LINEB < LINETb) i |= 2;
            POSTTCPchar(i);
            i = LINEA;
            POSTTCPchar(i >> 8);
            POSTTCPchar(i);
            i = LINEB;
            POSTTCPchar(i >> 8);
            POSTTCPchar(i);
            break;
        case CMDSETLINEFOLLOW: if (commandlen == 5) // set line following thrsholds and LEDS
            {
                if (nextcommand[1]& 1) LED2_IO = 1;
                else LED2_IO = 0;
                if (nextcommand[1]& 2) LED3_IO = 1;
                else LED3_IO = 0;
                i = nextcommand[3] | (nextcommand[2] << 8);
                LINETa = i;
                i = nextcommand[5] | (nextcommand[4] << 8);
                LINETb = i;
                POSTTCPhead(0, CMDSETLINEFOLLOW);
            }
            break;

        case CMDGETLIGHTTEMP:
            if (commandlen == 0) //send light/aux
            {
                POSTTCPhead(4, CMDGETLIGHTTEMP);
                i = photov;
                POSTTCPchar(i >> 8);
                POSTTCPchar(i);
                i = thermv;
                POSTTCPchar(i >> 8);
                POSTTCPchar(i);

            }
            break;

        case CMDPOWERSWITCH:
            if (commandlen == 1) //POWER SWITCH
            {
                POSTTCPhead(0, CMDPOWERSWITCH);
                I2S();
                I2send(0x14);
                I2send(0);
                I2send(nextcommand[1]);
                I2P();
            }
            break;
        case CMDPOWERSERV01:
            if (commandlen == 1) //POWER SERV0 1
            {
                POSTTCPhead(0, CMDPOWERSERV01);
                I2S();
                I2send(0x14);
                I2send(1);
                I2send(nextcommand[1]);
                I2P();
            }
            break;
        case CMDPOWERSERV02:
            if (commandlen == 1) //POWER SERV0 2
            {
                POSTTCPhead(0, CMDPOWERSERV02);
                I2S();
                I2send(0x14);
                I2send(2);
                I2send(nextcommand[1]);
                I2P();
            }
            break;

        case CMDGetAcceleromterCache:
            if (accelerometerCachePointer < accelerometerCacheSize - 1) {
                POSTTCPhead(0, CMDGetAcceleromterCache);
                break;
            }

            int size = accelerometerCacheSize;
            POSTTCPhead(size * 2, CMDGetAcceleromterCache);
            i = 0;
            for (i; i < size; i++) {
                POSTTCPchar(accelerometerCache[i] >> 8);
                POSTTCPchar(accelerometerCache[i]);
            }
            accelerometerCachePointer = 0;
            break;

        case CMDPOWERREADAD0:
            if (commandlen == 0) //POWER READ AD0
            {
                POSTTCPhead(2, CMDPOWERREADAD0);
                I2S();
                I2send(0x14);
                I2send(8);
                I2SR();
                I2send(0x15);
                Blow = I2GET(1);
                Bhigh = I2GET(0);
                I2P();
                POSTTCPchar(Bhigh);
                POSTTCPchar(Blow);
            }
            break;
        case CMDPOWERREADAD1:
            if (commandlen == 0) //POWER READ AD1
            {
                POSTTCPhead(2, CMDPOWERREADAD1);
                I2S();
                I2send(0x14);
                I2send(10);
                I2SR();
                I2send(0x15);
                Blow = I2GET(1);
                Bhigh = I2GET(0);
                I2P();
                POSTTCPchar(Bhigh);
                POSTTCPchar(Blow);
            }
            break;
        case CMDPOWERREADphotodiode:
            if (commandlen == 0) //POWER READ AD6  - photo diode
            {
                POSTTCPhead(2, CMDPOWERREADphotodiode);
                I2S();
                I2send(0x14);
                I2send(12);
                I2SR();
                I2send(0x15);
                Blow = I2GET(1);
                Bhigh = I2GET(0);
                I2P();
                POSTTCPchar(Bhigh);
                POSTTCPchar(Blow);
            }
            break;
        case CMDPOWERREADthermistor:
            if (commandlen == 0) //POWER READ AD7  - thermistor
            {
                POSTTCPhead(2, CMDPOWERREADthermistor);
                I2S();
                I2send(0x14);
                I2send(14);
                I2SR();
                I2send(0x15);
                Blow = I2GET(1);
                Bhigh = I2GET(0);
                I2P();
                POSTTCPchar(Bhigh);
                POSTTCPchar(Blow);
            }
            break;



        case CMDREADemfs: // back emfs
            if (commandlen == 0) {
                POSTTCPhead(4, CMDREADemfs);
                i = emfoffset1 - emf1v;
                POSTTCPchar(i >> 8);
                POSTTCPchar(i);
                i = emfoffset2 - emf2v;
                POSTTCPchar(i >> 8);
                POSTTCPchar(i);

