KaelanFouwels/Rover32/PIC32/WIFIROVER2016Gx/TCPIP/demo/rovercode.c
            }
            break;
        case CMDRDlightsensors: // the two integrated light sensors
            if (commandlen == 0) {
                POSTTCPhead(4, CMDRDlightsensors);
                i = lightav;
                POSTTCPchar(i >> 8);
                POSTTCPchar(i);
                i = lightbv;
                POSTTCPchar(i >> 8);
                POSTTCPchar(i);

            }
            break;
        case CMDMyMAC: // my mac address
            if (commandlen == 0) {
                POSTTCPhead(6, CMDMyMAC);
                for (i = 0; i < 6; i++) POSTTCPchar(AppConfig.MyMACAddr.v[i]);
            }
            break;
        case CMDRDMMA8452:
            if (commandlen == 0) //send accn MMA8452Q
            {
                I2S();
                I2send(0x38);
                I2send(0x00);
                I2SR();
                I2send(0x39);
                i = I2GET(0);
                I2P();
                if (i & 8) {
                    POSTTCPhead(6, CMDRDMMA8452);
                    I2S();
                    I2send(0x38);
                    I2send(0x01);
                    I2SR();
                    I2send(0x39);
                    for (i = 1; i <= 6; i++) {
                        POSTTCPchar(I2GET(i != 6));
                    }
                    I2P();
                } else POSTTCPhead(0, CMDRDMMA8452);
            }
            break;

        case CMDRDgyroSTATUS:
            if (commandlen == 0) //send gyro L3G4200D status
            {
                POSTTCPhead(2, CMDRDgyroSTATUS);
                I2S();
                I2send(0xd2);
                I2send(0x26 | 0x80);
                I2SR();
                I2send(0xd3);
                for (i = 1; i <= 2; i++) {
                    POSTTCPchar(I2GET(i != 2));
                }
                I2P();
            }
            break;
        case CMDRDgyro:
            if (commandlen == 0) //send gyro L3G4200D
            {
                I2S();
                I2send(0xd2);
                I2send(0x27);
                I2SR();
                I2send(0xd3);
                if ((I2GET(0) & 0x8) == 0) {
                    I2P();
                    POSTTCPhead(0, CMDRDgyro);
                } else {
                    I2P();
                    POSTTCPhead(8, CMDRDgyro);
                    I2S();
                    I2send(0xd2);
                    I2send(0x26 | 0x80);
                    I2SR();
                    I2send(0xd3);
                    POSTTCPchar(I2GET(1));
                    POSTTCPchar(I2GET(1));
                    for (i = 0; i < 6; i++) temparray[i] = I2GET(i != 5);
                    I2P();
                    POSTTCPchar(temparray[1]);
                    POSTTCPchar(temparray[0]);
                    POSTTCPchar(temparray[3]);
                    POSTTCPchar(temparray[2]);
                    POSTTCPchar(temparray[5]);
                    POSTTCPchar(temparray[4]);
                }
            }
            break;
        case CMDMagSTATUS:
            if (commandlen == 0) //send mag MAG3110FCR1  status
            {
                POSTTCPhead(2, CMDMagSTATUS);
                I2S();
                I2send(0x1c);
                I2send(0);
                I2SR();
                I2send(0x1d);
                POSTTCPchar(I2GET(0));
                I2P();
                I2S();
                I2send(0x1c);
                I2send(0xf);
                I2SR();
                I2send(0x1d);
                POSTTCPchar(I2GET(0));
                I2P();
            }
            break;
        case CMDMag:
            if (commandlen == 0) //send mag MAG3110FCR1  x,y,z raw
            {
                I2S();
                I2send(0x1c);
                I2send(0);
                I2SR();
                I2send(0x1d);
                if ((I2GET(0) & 0x8) == 0) {
                    POSTTCPhead(0, CMDMag);
                    I2P();
                } else {
                    I2P();
                    POSTTCPhead(6, CMDMag);
                    I2S();
                    I2send(0x1c);
                    I2send(1);
                    I2SR();
                    I2send(0x1d);
                    for (i = 1; i <= 6; i++) {
                        POSTTCPchar(I2GET(i != 6));
                    }
                    I2P();
                }
            }
            break;

        case CMDMagAngle:
            if (commandlen == 0) {
                if (MagHasValue == 0) {
                    POSTTCPhead(0, CMDMagAngle);
                }
                if (MagHasAngle == 0) {
                    POSTTCPhead(0, CMDMagAngle);
                } else {

                    f = MagAngle;

                    myfloatUnion.f = f;
                    POSTTCPhead(12, CMDMagAngle);
                    POSTTCPchar(myfloatUnion.s[0]);
                    POSTTCPchar(myfloatUnion.s[1]);
                    POSTTCPchar(myfloatUnion.s[2]);
                    POSTTCPchar(myfloatUnion.s[3]);
                    myfloatUnion.f = sx;
                    POSTTCPchar(myfloatUnion.s[0]);
                    POSTTCPchar(myfloatUnion.s[1]);
                    POSTTCPchar(myfloatUnion.s[2]);
                    POSTTCPchar(myfloatUnion.s[3]);
                    myfloatUnion.f = sy;
                    POSTTCPchar(myfloatUnion.s[0]);
                    POSTTCPchar(myfloatUnion.s[1]);
                    POSTTCPchar(myfloatUnion.s[2]);
                    POSTTCPchar(myfloatUnion.s[3]);
                }
            }
            break;
        case CMDdoSTEP:
            if (commandlen == 2) //do Step
            {
                I2S();
                I2send(0x12);
                I2send(4);
                I2send(nextcommand[1]);
                I2send(nextcommand[2]);
                I2P();
                I2S();
                I2send(0x12);
                I2send(6);
                I2send(1);
                I2P();
                POSTTCPhead(0, CMDdoSTEP);
            }
            break;
        case CMDStepStatus:
            if (commandlen == 0) //Step status
            {
                POSTTCPhead(1, CMDStepStatus);
                I2S();
                I2send(0x12);
                I2send(6);
                I2SR();
                I2send(0x13);
                POSTTCPchar(I2GET(0));
                I2P();
            }
            break;
        case CMDStepRead:
            if (commandlen == 0) //step data read
            {
                POSTTCPhead(128, CMDStepRead);
                I2S();
                I2send(0x12);
                I2send(128);
                I2SR();
                I2send(0x13);
                for (i = 1; i <= 128; i++) {
                    POSTTCPchar(I2GET(i != 128));
                }
                I2P();
            }
            break;
        case CMDstepInstRead:
            if (commandlen == 0) //step inst read
            {
                POSTTCPhead(2, CMDstepInstRead);
                I2S();
                I2send(0x12);
                I2send(8);
                I2SR();
                I2send(0x13);
                for (i = 1; i <= 2; i++) {
                    POSTTCPchar(I2GET(i != 2));
                }
                I2P();
            }
            break;
        case CMDreadSounds:
            if (commandlen == 0) {
                temphead = soundhead;
                temphead = (temphead - soundtail)& 2047;
                if (temphead > 128) temphead = 128;
                POSTTCPhead(temphead, CMDreadSounds);
                for (i = 1; i <= temphead; i++) {
                    POSTTCPchar(sounds[soundtail++]);
                    soundtail &= 2047;
                };
            }
            break;
        case CMDGetMotorSpeedWord: // set speed word ... return pos and speeds
            if (commandlen == 4) // set both motors
            {
                i = (char) (nextcommand[1]);
                j = (char) (nextcommand[3]);
                i = (i << 8) | nextcommand[2];
                j = (j << 8) | nextcommand[4];
                closedloop = 0;
                setspeed(j, i);
            }
            POSTTCPhead(12, CMDGetMotorSpeedWord);
            POSTTCPchar(pos1 >> 8);
            POSTTCPchar(pos1);
            POSTTCPchar(pos2 >> 8);
            POSTTCPchar(pos2);


            if (countup1) i = CspeedA;
            else i = -CspeedA;
            POSTTCPchar(i >> 8);
            POSTTCPchar(i);
            if (countup2) i = CspeedB;
            else i = -CspeedB;
            POSTTCPchar(i >> 8);
            POSTTCPchar(i);
            i = emfoffset1 - emf1v;
            POSTTCPchar(i >> 8);
            POSTTCPchar(i);
            i = emfoffset2 - emf2v;
            POSTTCPchar(i >> 8);
            POSTTCPchar(i);
            break;
        case CMDMotorSpeedClosed: // set speed accurate
            if (commandlen == 5) // set both motors
            {
                i = (char) (nextcommand[1]);
                j = (char) (nextcommand[3]);
                i = (i << 8) | nextcommand[2];
                j = (j << 8) | nextcommand[4];
                closedloop = nextcommand[5];
                if (!closedloop) {
                    DesiredL = 0;
                    DesiredR = 0;
                    erroriL = 0;
                    erroriR = 0;
                    speed1 = 0;
                    speed2 = 0;
                } else {
                    DesiredL = j;
                    DesiredR = i;
                }
            }
            POSTTCPhead(0, CMDMotorSpeedClosed);
            break;
            /*
                  case CMDGETstarpos:
                         if (commandlen==0)
                         {
                          POSTTCPhead(8,CMDGETstarpos);
                          for (i=0;i<6;i++)  POSTTCPchar(GPSRX[i]);
                          POSTTCPchar(GPSRXcount>>8);POSTTCPchar(GPSRXcount);
                         }
                        break;
             */
        case CMDGETusgps:
            if (commandlen == 0) {
                while (testU1() >= 24) flushU1(12);
                while ((testU1() >= 12) && (peakU1() != 0xa6)) readU1();
                if ((testU1() >= 12) && (peakU1() == 0xa6)) {
                    POSTTCPhead(8, CMDGETusgps);
                    for (i = 0; i < 4; i++) {
                        readU1();
                        POSTTCPchar(readU1());
                        POSTTCPchar(readU1());
                    }
                } else POSTTCPhead(0, CMDGETusgps);

