KaelanFouwels/Rover32/PIC32/WIFIROVER2016Gx/TCPIP/demo/rovercode.c
            }
            break;

        case CMDGyroPosition:
            if (commandlen == 0) {

                if (gyroRotationRadians == 0) {
                    POSTTCPhead(0, CMDGyroPosition);
                    break;
                }

                POSTTCPhead(2, CMDGyroPosition);
                POSTTCPchar((char) gyroRotationRadians >> 8);
                POSTTCPchar((char) gyroRotationRadians);
            }
            break;

        case CMDRotateRadians:
            if (commandlen == 0) {

                if (gyroRotationRadians == 0) {
                    POSTTCPhead(0, CMDGyroPosition);
                    break;
                }

                POSTTCPhead(2, CMDGyroPosition);
                POSTTCPchar((char) gyroRotationRadians >> 8);
                POSTTCPchar((char) gyroRotationRadians);
            }
            break;

        case CMDMoveForward:
            if (commandlen == 3) {
                i = (int) ((nextcommand[1] << 8) | nextcommand[2]);

                ForwardDistanceRemaining = i;
                isMoving = 1;

                pos1Zero = pos1;
                pos2Zero = pos2;
            }
            break;

        case CMDGetIsMovingForward:
            POSTTCPhead(1, CMDGetIsMovingForward);
            if (ForwardDistanceRemaining == -1 || ForwardDistanceRemaining == 0) {
                POSTTCPchar((char) 0);
            } else {
                POSTTCPchar((char) 1);
            }
            break;
    }
}

void moveForward(void) {

    int p = 0.1;

    int speedL = 400;
    int speedR = 400;

    int errL = (pos2 - pos2Zero) - (pos1 - pos1Zero);
    int errR = (pos1 - pos1Zero) - (pos2 - pos2Zero);

    speedL = speedL + errL * p;
    speedR = speedR + errR * p;

    setspeed(speedL, speedR);
}

void moveBackwards(void) {

    int p = 0.1;

    int speedL = -400;
    int speedR = -400;

    int errL = (pos2 - pos2Zero) - (pos1 - pos1Zero);
    int errR = (pos1 - pos1Zero) - (pos2 - pos2Zero);

    speedL = speedL - errL * p;
    speedR = speedR - errR * p;

    setspeed(speedL, speedR);


}

//Process packets

void ProcessIO(void) {
    if (ledFlag == 1) {
        ledFlag = 0;
        if (LED1_IO == 1) {
            LED1_IO = 0;
        } else {
            LED1_IO = 1;
        }
    }

    if (magnetometerFlag) {
        magnetometerFlag = 0;
        getMagnetometer();
    }

    if (accelerometerFlag) {
        accelerometerFlag = 0;
        getAccelerometerUp();
    }

    if (magnetometerAngleFlag) {
        magnetometerAngleFlag = 0;
        getMagnetometerAngle();
    }


    // Rotation
    if (areRotating && rotationFlag) {
        rotationFlag = 0;
        checkRotation();
    }


    if (PeriodA > 512) CspeedA = 0x8000000 / PeriodA;
    if (PeriodB > 512) CspeedB = 0x8000000 / PeriodB;
    if (CLflag) doclosedloop();



    // Movement
    if (isMoving && movementFlag) {
        movementFlag = 0;
        if ((abs(ForwardDistanceRemaining) - ((pos2 - pos2Zero) + (pos1 - pos1Zero)) / 2) <= 0) {
            setspeed(0, 0);
            isMoving = 0;
        } else {
            if (ForwardDistanceRemaining <= 0) {
                moveBackwards();
            } else {
                moveForward();
            }
        }
    }

    //Gyro

    if (yescomsdata()) {
        if (commandstate < 0) {
            if ((unsigned char) getcomsdata() == 0xff) {
                commandstate = 0;
                if (yescomsdata()) {
                    commandstate = (unsigned char) getcomsdata();
                    commandlen = commandstate - 1;
                    if (commandstate == 0) commandstate = -1;
                }
            }
        } else {
            if (commandstate == 0) {
                commandstate = (unsigned char) getcomsdata();
                commandlen = commandstate - 1;
                if (commandstate == 0) commandstate = -1;
            } else {
                while (yescomsdata() && (commandstate)) {
                    nextcommand[1 + (commandlen - commandstate)] = getcomsdata();
                    commandstate--;
                }
                if (commandstate == 0) {

                    processcommand();
                    commandstate = -1;
                }
            }
        }

    }
}

void uartsetup(void) {
    RxHead1 = RxTail1 = 0;
    RxHead2 = RxTail2 = 0;

    U1MODECLR = 0x0307;
    U2MODECLR = 0x0307;

    //set BRGH to high speed mode
    U1MODESET = 0x0008;
    U2MODESET = 0x0008;

    //set baud rate
    U1BRG = (GetPeripheralClock() / (57600 * 4)) - 1; //57600
    U2BRG = (GetPeripheralClock() / (57600 * 4)) - 1; //57600
    U1STA = 0x0400;
    U2STA = 0x0400;

    //set the URXEN
    U1STASET = 0x1000;
    U2STASET = 0x1000;


    U1STACLR = 0xC000;
    U1STACLR = 0x00C0;
    IFS0bits.U1EIF = 0;
    IFS0bits.U1RXIF = 0;
    IFS0bits.U1TXIF = 0;
    IFS1bits.U2EIF = 0;
    IFS1bits.U2RXIF = 0;
    IFS1bits.U2TXIF = 0;

    IPC6bits.U1IS = 0;
    IPC6bits.U1IP = 1;

    IPC8bits.U2IS = 0;
    IPC8bits.U2IP = 1;
    //enable uart ON bit
    U1MODESET = 0x8000;
    U2MODESET = 0x8000;

}

void __attribute((interrupt(ipl2), vector(_UART_1_VECTOR), nomips16)) _U1Interrupt(void) {
    if (IFS0bits.U1TXIF) {
        IFS0bits.U1TXIF = 0;
    }
    if (IFS0bits.U1RXIF) {
        while (U1STAbits.URXDA) {
            RX1[RxHead1] = U1RXREG;
            RxHead1 = (RxHead1 + 1) & (RXBUFFERsize - 1);
        }
        IFS0bits.U1RXIF = 0;
    }
    if (IFS0bits.U1EIF) {
        if (U1STAbits.OERR) {
            U1STAbits.OERR = 0; // any overrun errors clear
        }
        IFS0bits.U1EIF = 0;
    }
}

void __attribute((interrupt(ipl2), vector(_UART_2_VECTOR), nomips16)) _U2Interrupt(void) {
    if (IFS1bits.U2TXIF) {
        IFS1bits.U2TXIF = 0;
    }
    if (IFS1bits.U2RXIF) {
        while (U2STAbits.URXDA) {
            RX2[RxHead2] = U2RXREG;
            RxHead2 = (RxHead2 + 1) & (RXBUFFERsize - 1);
        }
        IFS1bits.U2RXIF = 0;
    }
    if (IFS1bits.U2EIF) {
        if (U2STAbits.OERR) {
            U2STAbits.OERR = 0; // any overrun errors clear
        }
        IFS1bits.U2EIF = 0;
    }
}

/****************************************************************************
  Function:
    static void InitializeBoard(void)

  Description:
    This routine initializes the hardware.
  Precondition:
    None

  Parameters:
    None - None

  Returns:
    None

