KaelanFouwels/Rover32/PIC32/WIFIROVER2016Gx/TCPIP/demo/rovercode.c
  Remarks:
    None
 ***************************************************************************/
void InitializeBoard(void) {
    UINT32 actualClock;

    // init ports for analog  AN2 to AN3 are analog
    AD1PCFG = 0xffff3c33;
    IR_TRIS = 1;
    //	lastIR=IR_IO;
    IC1_TRIS = 1;
    IC2_TRIS = 1;
    IC3_TRIS = 1;
    IC4_TRIS = 1;
    TRISDbits.TRISD6 = 1;
    TRISDbits.TRISD7 = 1;
    // LEDs
    LED0_IO = 1;
    LED1_IO = 1;
    LED0_TRIS = 0;
    LED1_TRIS = 0;

    LED2_TRIS = 0; // used for line following
    LED3_TRIS = 0;
    LED2_IO = 1;
    LED3_IO = 1;
    // Enable multi-vectored interrupts
    INTEnableSystemMultiVectoredInt();

    // Enable optimal performance
    SYSTEMConfigPerformance(GetSystemClock());
    mOSCSetPBDIV(OSC_PB_DIV_1); // Use 1:1 CPU Core:Peripheral clocks

    // Disable JTAG port so we get our I/O pins back, but first
    // wait 50ms so if you want to reprogram the part with
    // JTAG, you'll still have a tiny window before JTAG goes away.
    // The PIC32 Starter Kit debuggers use JTAG and therefore must not
    // disable JTAG.
    DelayMs(50);
#if !defined(__MPLAB_DEBUGGER_PIC32MXSK) && !defined(__MPLAB_DEBUGGER_FS2)
    DDPCONbits.JTAGEN = 0;
#endif


    T3CON = 0;
    PR3 = 255;
    T3CON = 0x8000;
    AD1CHS = 2;

    // ADC
    AD1CON1 = 0x0444; // Turn on, auto sample start, convert on t3,
    AD1CON2 = 0x041e; // AVdd, AVss, int every 8 conversions, MUXA only, scan
    AD1CON3 = 0x1003; // 16 Tad auto-sample, Tad = 3*Tcy
    AD1CSSL = 0xc3cc; // Scan a/ds
    AD1CON1 = 0x8444; // Turn on, auto sample start, convert on t3,


    // Deassert all chip select lines so there isn't any problem with
    // initialization order.  Ex: When ENC28J60 is on SPI2 with Explorer 16,
    // MAX3232 ROUT2 pin will drive RF12/U2CTS ENC28J60 CS line asserted,
    // preventing proper 25LC256 EEPROM operation.
#if defined(WF_CS_TRIS)
    WF_CS_IO = 1;
    WF_CS_TRIS = 0;
#endif


    LeftMotorF = 0;
    LeftMotorF_TRIS = 0;
    LeftMotorB = 0;
    LeftMotorB_TRIS = 0;
    RightMotorF = 0;
    RightMotorF_TRIS = 0;
    RightMotorB = 0;
    RightMotorB_TRIS = 0;
    OC3CON = 0;
    OC4CON = 0;
    OC3R = OC3RS = 0;
    OC4R = OC4RS = 0;
    OC2CON = 0;
    OC5CON = 0;
    OC2R = OC2RS = 0;
    OC5R = OC5RS = 0;

    T2CON = 0;
    T2CON = 0x8070;

    IC1CON = 0x0081;
    IC1CON = 0x8081;
    IC2CON = 0x0081;
    IC2CON = 0x8081;
    IC3CON = 0x0081;
    IC3CON = 0x8081;
    IC4CON = 0x0081;
    IC4CON = 0x8081;
    IFS0bits.IC1IF = 0;
    IFS0bits.IC2IF = 0;
    IFS0bits.IC3IF = 0;
    IFS0bits.IC4IF = 0;

    IPC1bits.IC1IS = 0;
    IPC1bits.IC1IP = 3;

    IPC3bits.IC3IS = 0;
    IPC3bits.IC3IP = 3;

    UARTTX1_TRIS = 0;
    UARTRX1_TRIS = 1;
    UARTTX2_TRIS = 0;
    UARTRX2_TRIS = 1;



    IFS1bits.AD1IF = 0;
    IPC6bits.AD1IS = 0;
    IPC6bits.AD1IP = 2;




    actualClock = I2CSetFrequency(I2C1, GetPeripheralClock(), 100000);
    // Enable the I2C bus
    I2CEnable(I2C1, TRUE);


}

